{
    "label": "Talent",
    "folders": {
        "Shield": "Shield",
        "Skills": "Skills",
        "Two-Handed": "Two-Handed",
        "Morale": "Morale",
        "Block": "Block",
        "Melee": "Melee",
        "Defense": "Defense",
        "Initiative": "Initiative",
        "Other": "Other",
        "Spellcraft: Gestures": "Spellcraft: Gestures",
        "Spellcraft: Runes": "Spellcraft: Runes",
        "Miscellaneous": "Miscellaneous",
        "Training": "Training",
        "Dodge": "Dodge",
        "Willpower": "Willpower",
        "Movement": "Movement",
        "One-Handed": "One-Handed",
        "Resistances": "Resistances",
        "Spellcraft": "Spellcraft",
        "Utility": "Utility",
        "Finesse": "Finesse",
        "Thrown": "Thrown",
        "Engagement": "Engagement",
        "Resources": "Resources",
        "Critical Hits": "Critical Hits",
        "Dual Wield": "Dual Wield",
        "General": "General",
        "Signature": "Signature",
        "Actions": "Actions",
        "Ranged": "Ranged",
        "Weaponry": "Weaponry",
        "Parry": "Parry",
        "Spellcraft: Inflection": "Spellcraft: Inflection",
        "Tradecraft": "Tradecraft",
        "Armor": "Armor",
        "Action": "Action",
        "Focus": "Focus",
        "Health": "Health",
        "Heavy": "Heavy",
        "Unarmed": "Unarmed",
        "Projectile": "Projectile"
    },
    "entries": {
        "Alchemical Resolve": {
            "name": "Alchemical Resolve",
            "description": "You rapidly apply alchemical vapours which instill your ally with supplemental bravery in the face of horror.",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Alchemical Resolve": {
                        "name": "Alchemical Resolve",
                        "description": "<p>You rapidly bolster the Morale of an ally within 4 feet by applying vapours. Perform a <strong>Medicine Check</strong> against the target's Madness Threshold. Successful checks restore Morale.</p>"
                    }
                }
            }
        },
        "Alchemy Journeyman": {
            "name": "Alchemy Journeyman"
        },
        "Alchemy Novice": {
            "name": "Alchemy Novice"
        },
        "Anticipate Harm": {
            "name": "Anticipate Harm",
            "description": "Your keen reflexes and acuity allow you to anticipate imminent danger and react to avoid it.",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Anticipate Harm": {
                        "name": "Anticipate Harm",
                        "condition": "You are targeted by an area-of-effect attack, the source of which you can see.",
                        "description": "<p>You may immediately move 4 feet after the area-of-effect of the attack is declared. If this movement escapes the area of the attack, you are unaffected.</p>"
                    }
                }
            }
        },
        "Arcana Adept": {
            "name": "Arcana Adept",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You gain the <strong>Adept </strong>rank in the <strong>Arcana </strong>skill, providing a <strong>+2 Skill Bonus</strong>.</span></p>"
        },
        "Arcana Journeyman": {
            "name": "Arcana Journeyman",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You gain the <strong>Journeyman</strong> rank in the <strong>Arcana </strong>skill, providing a <strong>+1 Skill Bonus</strong>.</span></p>"
        },
        "Arcana Master": {
            "name": "Arcana Master",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You gain the <strong>Master </strong>rank in the <strong>Arcana </strong>skill, providing a <strong>+3 Skill Bonus</strong>.</span></p>"
        },
        "Arcana Novice": {
            "name": "Arcana Novice",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">Your education covered the fundamentals of metaphysics and magical theory, the relationship between the runes, the opposing nature of order and chaos, and a cursory introduction to spiritual beings including the most commonly known deified and demonized figures of worship. You gain the <strong>Novice</strong> rank in the <strong>Arcana </strong>skill and are no longer considered <strong>Untrained</strong> in that skill.</span></p><p><span style=\"font-family:Vollkorn, serif\">Your rudimentary understanding of the principle grammar of magic is sufficient to identify which lesser rune a spell or ritual may be using, as well as the gesture used (if not the inflection). You can identify whether a figure is influenced more by chaos or by order, and can spot the signs of common spirits (both lesser and greater). You know enough about religious customs to communicate with those who worship a particular spirit or deity without embarrassing yourself.</span></p>"
        },
        "Arcane Archer": {
            "name": "Arcane Archer",
            "description": "<p>Your skill with archery can shape your spellcraft, partially substituting for the somatic gestures of traditional spellcasting.</p><p>While using a <strong>Projectile </strong>weapon as your mainhand weapon, you ignore the free-hand requirement for casting spells using the <strong>Arrow</strong> gesture and the range of those spells becomes your weapon range.</p><p>Immediately after performing a <strong>Strike</strong> with a projectile weapon, you may cast a spell with its <strong>Action</strong> cost reduced by 1.</p>"
        },
        "Armored Efficiency": {
            "name": "Armored Efficiency",
            "description": "<p>You are trained in wearing the heaviest types of armor while still retaining mobility. You are able to use a free Movement action once per Turn while wearing Heavy armor.</p>"
        },
        "Armored Shell": {
            "name": "Armored Shell",
            "description": "<p>You are expert in using your armor in combination with your shield to create a defensive shell.</p><p>When you have the <strong>Guarded</strong> condition and have a <strong>Heavy Shield</strong> equipped, your base <strong>Armor</strong> defense is reduced by half but your <strong>Block</strong> defense increases by a corresponding amount.</p>"
        },
        "Artful Parry": {
            "name": "Artful Parry",
            "description": "<p>You anticipate dodging an attack, intercepting it to intentionally Parry the strike.</p><p></p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Artful Parry": {
                        "name": "Artful Parry",
                        "condition": "You Dodge an incoming melee Strike.",
                        "description": "<p>When you defend against a melee attack using the <strong>Dodge</strong> defense, you can react and expend <strong>Focus</strong> to instead <strong>Parry</strong> the attack.</p>"
                    }
                }
            }
        },
        "Assassin": {
            "name": "Assassin",
            "description": "<p>You specialize in bringing death the the unwary. Any Strike or Spell attack against an <strong>Unaware</strong> target becomes <strong>Deadly</strong>.</p><p>An Unaware creature hit by your attack may not alert its allies until its own turn in Combat.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Mark For Death": {
                        "name": "Mark For Death",
                        "condition": "You are unobserved.",
                        "description": "You spend 1 minute studying a creature. Perform a Knowledge Test about your target. If successful, you learn all damage types against which the target is Vulnerable. Your minimum Initiative during the first round of Combat becomes one greater than the Initiative of your marked target.</p>"
                    }
                }
            }
        },
        "Assess Strength": {
            "name": "Assess Strength",
            "description": "<p>You take a moment to observe a creature which you can see and develop intuition about its areas of strength.</p>\n<p>Perform a <strong>Knowledge Test</strong> using a Skill chosen by the Gamemaster. On a success, you learn which Defense type of Physical, Fortutude, Willpower, or Reflex is highest for the creature. On a Critical Success you learn the two highest defense types.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Assess Strength": {
                        "name": "Assess Strength",
                        "description": "<p>You observe a creature you can see to assess it's notable areas of strength.</p>"
                    }
                }
            }
        },
        "Athletics Adept": {
            "name": "Athletics Adept",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You gain the <strong>Adept </strong>rank in the <strong>Athletics </strong>skill, providing a <strong>+2 Skill Bonus</strong>.</span></p>"
        },
        "Athletics Journeyman": {
            "name": "Athletics Journeyman",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You gain the <strong>Journeyman </strong>rank in the <strong>Athletics </strong>skill, providing a <strong>+1 Skill Bonus</strong>.</span></p>"
        },
        "Athletics Master": {
            "name": "Athletics Master",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You gain the <strong>Master </strong>rank in the <strong>Athletics </strong>skill, providing a <strong>+3 Skill Bonus</strong>.</span></p>"
        },
        "Athletics Novice": {
            "name": "Athletics Novice",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You have received training in basic athletics. You gain the <strong>Novice</strong> rank in the <strong>Athletics</strong> skill and are no longer considered <strong>Untrained</strong> in that skill.</span></p><p><span style=\"font-family:Vollkorn, serif\">You know whether a surface can support your weight or not, how to find handholds while climbing, and how to distribute your weight for buoyancy when swimming. You know how to run for distance, and how to pace yourself to avoid exhaustion.</span></p>"
        },
        "Awareness Adept": {
            "name": "Awareness Adept",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You gain the <strong>Adept </strong>rank in the <strong>Awareness </strong>skill, providing a <strong>+2 Skill Bonus</strong>.</span></p>"
        },
        "Awareness Journeyman": {
            "name": "Awareness Journeyman",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You gain the <strong>Journeyman </strong>rank in the <strong>Awareness </strong>skill, providing a <strong>+1 Skill Bonus</strong>.</span></p>"
        },
        "Awareness Master": {
            "name": "Awareness Master",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You gain the <strong>Master </strong>rank in the <strong>Awareness </strong>skill, providing a <strong>+3 Skill Bonus</strong>.</span></p>"
        },
        "Awareness Novice": {
            "name": "Awareness Novice",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You have been trained in the basics of situational awareness, and are able to notice important details about your environment. You gain the <strong>Novice</strong> rank in the <strong>Awareness </strong>skill and are no longer considered <strong>Untrained</strong> in that skill.</span></p><p><span style=\"font-family:Vollkorn, serif\">You know to check for exits when you enter a room, and how to look for concealed weapons, hidden traps, and other threats. You know how to spot when you are being followed, and how to search for common hiding places.</span></p>"
        },
        "Backstab": {
            "name": "Backstab",
            "description": "<p>You focus your cunning instincts on exploiting the weak points of a flanked target. You identify an opportunity and strike with deadly efficiency.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Backstab": {
                        "name": "Backstab",
                        "condition": "You are attacking a target with the Flanked condition.",
                        "description": "<p>You <strong>Strike</strong> with your mainhand weapon against a <strong>Flanked</strong> target, dealing <strong>Deadly</strong> damage.</p>"
                    }
                }
            }
        },
        "Bard": {
            "name": "Bard",
            "description": "<p>You practice the oral and musical traditions of heroic storytelling to inspire courage in your allies, demoralize your foes, and be quick with unconventional solutions to problems.</p><p>You learn <strong>Rune: Spirit </strong>if you do not already know it. When restoring the morale of allies using the Rune of Spirit you gain <strong>+2 Boons</strong> to your roll.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Laughing Matter": {
                        "name": "Laughing Matter",
                        "condition": "An enemy fails to affect you or any ally with an attack.",
                        "description": "<p>When an enemy uses an attack that fails to affect you or any ally, you construct a cutting jest or pantomime which makes a fool of their feeble effort.</p><p>You make an <strong>Performance</strong> skill attack against the target's <strong>Fortitude</strong>, dealing <strong>Psychic</strong> damage to <strong>Morale</strong> upon a success. Furthermore, upon a success, the target suffers 1 <strong>Bane</strong> to all rolls until the start of their next turn.</p><p>The target must be able to see and understand you to be affected by this ability.</p>",
                        "effects": [
                            {
                                "name": "Laughing Matter"
                            }
                        ]
                    }
                }
            }
        },
        "Battle Focus": {
            "name": "Battle Focus",
            "description": "You find focus and calm within the thrill of battle. When you achieve a <strong>Critical Hit</strong> that deals damage to Health or Morale you gain +1 Focus. This benefit may occur at most once per Round."
        },
        "Beastmaster": {
            "name": "Beastmaster",
            "description": "<p>You have trained your animal companion to aid you in combat. Your companion may participate in encounters as an allied combatant.</p>"
        },
        "Berserk Strike": {
            "name": "Berserk Strike",
            "description": "<p>You channel your lust for combat into an adrenaline-fueled strike which increases in power as you become more wounded.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Berserk Strike": {
                        "name": "Berserk Strike",
                        "description": "<p>You imbue your strike with momentum and intensity, increasing the <strong>Damage Bonus</strong> of your strike according to your missing <strong>Health</strong>.</p><ul><li><p>If your Health is below 75%, your Strike deals <strong>+1 Damage</strong></p></li><li><p>If your Health is below 50%, your Strike deals <strong>+2 Damage</strong></p></li><li><p>If your Health is below 25%, your Strike deals <strong>+3 Damage</strong></p></li></ul><p>This damage bonus is doubled if you are using a <strong>Two-Handed</strong> weapon.</p>"
                    }
                }
            }
        },
        "Berserker": {
            "name": "Berserker",
            "description": "<p>You revel in the thrill of combat, hurling yourself into the fray with reckless abandon.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Berserker Rage": {
                        "name": "Berserker Rage",
                        "condition": "You have suffered damage to your Health pool since your last turn in Combat.",
                        "description": "You become Enraged. While Enraged you deal 4 additional damage on all melee attacks. You may attempt to end the effect on your own turn by succeeding on a Willpower test against a DC of 20. The effect ends automatically when Combat is concluded.",
                        "effects": [
                            {
                                "name": "Berserker Rage"
                            }
                        ]
                    }
                }
            }
        },
        "Blood Frenzy": {
            "name": "Blood Frenzy",
            "description": "<p>Your battle lust spurs you to feats of heightened action. When you achieve a <strong>Critical Hit</strong> that deals damage to Health you immediately gain +1 Action. This benefit may only happen once per Round.</p>"
        },
        "Blood Magic": {
            "name": "Blood Magic",
            "description": "<p>You rely upon occult techniques to transform physical pain into arcane potential. </p><p>You cast spells by spending <strong>Health</strong> instead of <strong>Focus</strong>. When casting a spell each point of Focus costs 10 points of Health instead. Spells you cast cannot restore your own <strong>Health</strong>.</p>"
        },
        "Bloodletter": {
            "name": "Bloodletter",
            "description": "<p>Your precision with weapons which deal Slashing or Piercing damage can cause the Bleeding condition on Critical Hits which deal damage to Health.</p><p>The Bleeding effect lasts for 1 round and deals your Dexterity score as additional damage to Health.</p>"
        },
        "Body Block": {
            "name": "Body Block",
            "description": "You lean into an attack which was otherwise defended with your Armor, converting its result into a Block instead.",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Body Block": {
                        "name": "Body Block",
                        "condition": "You defend against a melee attack with your Armor or as a Glance.",
                        "description": "An attack which otherwise is defended by your Armor or produced a Glancing blow is converted to a Block and deals no damage."
                    }
                }
            }
        },
        "Bull Rush": {
            "name": "Bull Rush",
            "description": "<p>You can use your physical prowess to push past opponents who block your path.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Bull Rush": {
                        "name": "Bull Rush",
                        "description": "<p>Make an <strong>Athletics </strong>skill Attack against an adjacent enemy contested by your target's Fortitude defense. On a success you may move up to your <strong>Stride</strong> directly through the enemy's space. Your enemy is knocked Prone and may not make any attack of opportunity against you. On a failure your movement is blocked and your remain in your current position.</p>",
                        "effects": [
                            {
                                "name": "Bull Rush"
                            }
                        ]
                    }
                }
            }
        },
        "Bulwark": {
            "name": "Bulwark",
            "description": "<p>You have expertise in using a <strong>Shield</strong> to defend yourself and others.</p><p>Once per Turn while you have a Shield equipped, you may use the <strong>Defend</strong> action at a reduced cost of 1 Action Point.</p>"
        },
        "Cadence": {
            "name": "Cadence",
            "description": "<p>You are drilled in performing sequences of melee attacks with rhythmic precision. When you <strong>Strike</strong> multiple times in sequence using a one-handed melee weapon you gain a stacking <strong>+1 Boon</strong> for each successive attack.</p><p></p>"
        },
        "Carefree": {
            "name": "Carefree",
            "description": "<p>You are able to compartmentalize and brush off setbacks, providing a remarkable ability to recover from damage to your Morale.</p>\n<p>Your <strong>Madness Threshold</strong> is reduced by 1, making you easier to heal.</p>"
        },
        "Clarify Intent": {
            "name": "Clarify Intent",
            "description": "You use apply your situational awareness and persuasiveness to rapidly communicate a plan of action to an ally.",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Clarify Intent": {
                        "name": "Clarify Intent",
                        "description": "<p>You explain your intentions to an ally within 12 feet. Make an <strong>Diplomacy</strong> skill attack against your ally's Madness Threshold. If successful they gain +1 <strong>Focus</strong> and +1 <strong>Boon</strong> to actions made within the next Round.</p>",
                        "effects": [
                            {
                                "name": "Clarify Intent"
                            }
                        ]
                    }
                }
            }
        },
        "Cleave": {
            "name": "Cleave",
            "description": "This martial technique is a specialized two-handed fighting maneuver which relies upon brute strength to swing your weapon in a wide arc, hitting multiple enemies in its path.",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Cleave": {
                        "name": "Cleave",
                        "description": "<p>A ferocious two-handed swing cleaves through foes in a 120 degree arc.</p>"
                    }
                }
            }
        },
        "Combat Medicine": {
            "name": "Combat Medicine",
            "description": "Your knowledge and skill in Medicine covers the rapid triage, diagnosis, and treatment of wounds.",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Combat Medicine": {
                        "name": "Combat Medicine",
                        "description": "<p>You rapidly treat the wounds of an ally within 4 feet. Perform a <strong>Medicine Check</strong> against the target's Wounds Threshold. Your ally's Health is increased by the amount of the Roll in excess of the threshold.</p>"
                    }
                }
            }
        },
        "Concussive Blows": {
            "name": "Concussive Blows",
            "description": "<p>Your physical power wielding melee weapons which deal Bludgeoning damage can cause the <strong>Staggered</strong> condition on Critical Hits which deal damage to Health.</p>\n<p>The Staggered effect lasts for 1 round and reduces your target's maximum Action by 1.</p>"
        },
        "Conjurer": {
            "name": "Conjurer",
            "description": "<p>You are a master of Conjuration and the Gesture of Creation to manifest arcane energy as physical form. You can maintain up to 3 such creations simultaneously rather than only one.</p>"
        },
        "Conserve Effort": {
            "name": "Conserve Effort",
            "description": "<p>You find calmness and focus in conserving your effort in battle. When you end your <strong>Turn</strong> with un-spent Action you gain <strong>+1 Focus</strong>.</p>"
        },
        "Cooking Journeyman": {
            "name": "Cooking Journeyman"
        },
        "Cooking Novice": {
            "name": "Cooking Novice"
        },
        "Counter Evade": {
            "name": "Counter Evade",
            "description": "<p>You are practiced in evasive fighting styles which use an enemy's missed attack to devise an opening to counter-attack.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Counter Evade": {
                        "name": "Counter Evade",
                        "condition": "You Dodge an incoming melee Strike.",
                        "description": "<p>When you defend against a melee attack with a <strong>Dodge</strong>, you may expend <strong>Focus</strong> to retaliate with a reduced-cost <strong>Strike</strong> using your mainhand weapon.</p>"
                    }
                }
            }
        },
        "Counter Riposte": {
            "name": "Counter Riposte",
            "description": "<p>You are expert in translating a parried attack into a swift counter against your exposed enemy.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Counter Riposte": {
                        "name": "Counter Riposte",
                        "condition": "You Parry an incoming melee Strike.",
                        "description": "<p>When you defend against a melee attack with a <strong>Parry</strong>, you may react and expend <strong>Focus</strong> to retaliate with a reduced-cost <strong>Strike</strong> which benefits from the <strong>Exposed</strong> condition.</p>"
                    }
                }
            }
        },
        "Counter Spell": {
            "name": "Counter Spell",
            "description": "<p>You can attempt to unravel and negate the spellcraft of other mages.</p>\n<section class=\"construction\">\n<p>Counter-Spell mechanics are preliminary and not implemented in Playtest 1. You may test the <em>intention</em> of this talent by working with your GM, but this process will not be refined or automated until a later Playtest phase.</p>\n</section>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Counter Spell": {
                        "name": "Counter Spell",
                        "condition": "Another creature which you can see is casting a spell.",
                        "description": "You form arcane energy into a countervailing spellcraft. Designate a Rune and Gesture which you know to attempt to counter the spell. You must be able to hit your target with your chosen Gesture. Choosing a Rune which is opposed to the Rune being cast adds +3 Boons to your roll. Choosing the same Gesture as the one being cast adds +3 Boons to your roll. Perform an <strong>Opposed Test</strong> against the caster of the spell using the Ability, Skill, and Enchantment bonuses of the respective spells being cast. If your roll exceeds theirs, the spell is countered and its magic is nullified."
                    }
                }
            }
        },
        "Counter Strike": {
            "name": "Counter Strike",
            "description": "<p>You are trained to transition between defending with your shield and a swift counter-attack.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Counter Strike": {
                        "name": "Counter Strike",
                        "condition": "You Block an incoming melee Strike.",
                        "description": "<p>When you defend against a melee attack with a <strong>Block</strong> you may expend <strong>Focus</strong> to retaliate with a reduced-cost <strong>Strike</strong> using your mainhand weapon.</p>"
                    }
                }
            }
        },
        "Deception Adept": {
            "name": "Deception Adept",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You gain the <strong>Adept </strong>rank in the <strong>Deception </strong>skill, providing a <strong>+2 Skill Bonus</strong>.</span></p>"
        },
        "Deception Journeyman": {
            "name": "Deception Journeyman",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You gain the <strong>Journeyman </strong>rank in the <strong>Deception </strong>skill, providing a <strong>+1 Skill Bonus</strong>.</span></p>"
        },
        "Deception Master": {
            "name": "Deception Master",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You gain the <strong>Master </strong>rank in the <strong>Deception </strong>skill, providing a <strong>+3 Skill Bonus</strong>.</span></p>"
        },
        "Deception Novice": {
            "name": "Deception Novice",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You are a liar and manipulator, and deception is a skill you've practiced. You gain the <strong>Novice</strong> rank in the <strong>Deception </strong>skill and are no longer considered <strong>Untrained</strong> in that skill.</span></p><p><span style=\"font-family:Vollkorn, serif\">You know how to construct basic lies and cons, and the telltale signs that tend to give away poor liars. You can construct a basic forgery for most common documents, but they won't stand up to any measure of close scrutiny.</span></p>"
        },
        "Defensive Roll": {
            "name": "Defensive Roll",
            "description": "<p>You are a nimble skirmisher, always in movement to stay one step ahead of your enemies in combat.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Defensive Roll": {
                        "name": "Defensive Roll",
                        "condition": "You Dodge an incoming melee Strike.",
                        "description": "<p>When you <strong>Dodge</strong> a melee attack you can expend <strong>Focus</strong> to leap into a defensive roll, moving up to your <strong>Size</strong> in any direction.</p>"
                    }
                }
            }
        },
        "Dervish": {
            "name": "Dervish",
            "description": "<p>You are specialized in fighting with two weapons. In combat you become a whirlwind of weapons, deadly to any foes who approach.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Whirlwind": {
                        "name": "Whirlwind",
                        "description": "<p>You become a cyclone of whirling weaponry, making <strong>Strike</strong> attacks with both weapons against every enemy within range.</p>"
                    }
                }
            }
        },
        "Diplomacy Adept": {
            "name": "Diplomacy Adept",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You gain the <strong>Adept </strong>rank in the <strong>Diplomacy </strong>skill, providing a <strong>+2 Skill Bonus</strong>.</span></p>"
        },
        "Diplomacy Journeyman": {
            "name": "Diplomacy Journeyman",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You gain the <strong>Journeyman </strong>rank in the <strong>Diplomacy </strong>skill, providing a <strong>+1 Skill Bonus</strong>.</span></p>"
        },
        "Diplomacy Master": {
            "name": "Diplomacy Master",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You gain the <strong>Master </strong>rank in the <strong>Diplomacy </strong>skill, providing a <strong>+3 Skill Bonus</strong>.</span></p>"
        },
        "Diplomacy Novice": {
            "name": "Diplomacy Novice",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You know the basics of debate and how to use rhetorical devices to make your arguments more convincing. You gain the <strong>Novice</strong> rank in the <strong>Diplomacy </strong>skill and are no longer considered <strong>Untrained</strong> in that skill.</span></p><p><span style=\"font-family:Vollkorn, serif\">You know how to leverage emotion in your words to inspire others or sway their opinions. You can make a convincing argument, and you can generally steer others to agree with your point of view.</span></p>"
        },
        "Dirty Tricks": {
            "name": "Dirty Tricks",
            "description": "You have pouches of sand and dust that you use to temporarily distract or blind an enemy.",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Dirty Tricks": {
                        "name": "Dirty Tricks",
                        "description": "<p>You fling debris into the eyes of an enemy. If the Strike is successful, they are Blinded until the end of their next Turn.</p>",
                        "effects": [
                            {
                                "name": "Dirty Tricks"
                            }
                        ]
                    }
                }
            }
        },
        "Disarming Strike": {
            "name": "Disarming Strike",
            "description": "<p>A martial technique designed to disarm your opponent, forcing them to drop an object held in one of their hands.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Disarming Strike": {
                        "name": "Disarming Strike",
                        "description": "<p>You make a <strong>Strike </strong>against a the <strong>Reflex</strong> defense of a single target. The technique is <strong>Difficult</strong> to perform and deals reduced damage. If successful, the target's mainhand weapon is <strong>Dropped</strong>.</p>"
                    }
                }
            }
        },
        "Distance Runner": {
            "name": "Distance Runner",
            "description": "You are adept at covering distance quickly. Your <strong>Stride</strong> increases by 1."
        },
        "Diversionist": {
            "name": "Diversionist",
            "description": "<p>You specialize in using subterfuge to distract or trick your opponent during combat.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Distract": {
                        "name": "Distract",
                        "description": "<p>You make a <strong>Deception</strong> based <strong>Skill Attack</strong> against the <strong>Willpower </strong>defense of a target within 30 feet which can see or hear you. On a success, the target loses <strong>1 Focus</strong>.</p>"
                    }
                }
            }
        },
        "Dread Lord": {
            "name": "Dread Lord",
            "description": "<p>You exude a terrible presence on the battlefield which tests the morale of nearby enemies that behold you, breaking the resolve of the weak-willed.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Formidable Presence": {
                        "name": "Formidable Presence",
                        "description": "<p>You make an Intimidation skill attack against the Willpower defense of enemies within 12 feet, dealing Void damage to Morale and causing the Frightened condition for 1 Round to those whose defense you overcome.</p>",
                        "effects": [
                            {
                                "name": "Formidable Presence"
                            }
                        ]
                    }
                }
            }
        },
        "Dual Wield": {
            "name": "Dual Wield",
            "description": "<p>You are adept at fighting with two weapons simultaneously. You can weave attacks together to strike more rapidly than possible with a single weapon.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Offhand Strike": {
                        "name": "Offhand Strike",
                        "description": "<p>Immediately after you perform a basic Strike with your mainhand weapon, you make a reduced-cost fullow-up <strong>Strike</strong> with your <strong>offhand</strong> weapon.</p>"
                    }
                }
            }
        },
        "Dustbinder": {
            "name": "Dustbinder",
            "description": "<p>You are highly skilled in weaving the Rune of Earth. Spells which use this Rune cause the Corroding condition on Critical Hits.</p><p>The Corroding effect lasts for 3 Rounds and deals your Wisdom score as Acid damage to Health each Round.</p>"
        },
        "Enchanting Journeyman": {
            "name": "Enchanting Journeyman"
        },
        "Enchanting Novice": {
            "name": "Enchanting Novice"
        },
        "Evasive Shot": {
            "name": "Evasive Shot",
            "description": "<p>You are an expert at firing shots with ranged weaponry while evading enemy attacks. After performing a ranged weapon attack, you gain half your <strong>Stride</strong> in additional free movement.</p>"
        },
        "Executioner's Strike": {
            "name": "Executioner's Strike",
            "description": "<p>You deliver a single decisive strike against a wounded enemy.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Executioner's Strike": {
                        "name": "Executioner's Strike",
                        "condition": "Your target is Bloodied.",
                        "description": "<p>You deliver a Deadly Strike with a two-handed heavy weapon. If your attack is successful, your opponent also suffers the Bleeding condition for 3 Rounds, taking additional damage each Round equal to your Strength score.</p>",
                        "effects": [
                            {
                                "name": "Executioner's Strike"
                            }
                        ]
                    }
                }
            }
        },
        "Extoll Deeds": {
            "name": "Extoll Deeds",
            "description": "You inspire courage within your allies by extolling the heroic deeds of a companion. You may react by composing a verse, making a quip, or shouting a battle cry when an ally you can see <strong>Incapacitates</strong> or achieves a <strong>Critical Hit</strong> against an enemy creature. The celebration of these heroic deeds restores the Morale of your allies within 6 spaces.",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Extoll Deeds": {
                        "name": "Extoll Deeds",
                        "condition": "An ally whom you can see slays or scores a critical hit against an enemy.",
                        "description": "<p>You compose a verse, make a quip, or shout a battle cry to extoll the heroic deeds of one of your allies. All allies near to you regain <strong>Morale</strong> equal to half your <strong>Presence</strong> score.</p>"
                    }
                }
            }
        },
        "Eye of the Storm": {
            "name": "Eye of the Storm",
            "description": "<p>After you Delay your Turn, gain +2 Boons on any Strike or Spell attack against an enemy that you allowed to act before you that Round.</p><p>TODO: Needs automation. For now apply boons manually.</p>"
        },
        "Fan of Arrows": {
            "name": "Fan of Arrows",
            "description": "This difficult ranged weaponry technique allows you to fire a multiple shots with your weapon in a sweeping cone, each targeting a different enemy in the area of effect.",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Fan of Arrows": {
                        "name": "Fan of Arrows",
                        "description": "<p>You fire multiple projectiles from your ranged weapon in an arc, striking all enemy targets within a 40 foot cone.</p>"
                    }
                }
            }
        },
        "Feinting Strike": {
            "name": "Feinting Strike",
            "description": "<p>A two-weapon technique which makes a feint with your primary weapon, exposing your target for an off-hand attack.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Feinting Strike": {
                        "name": "Feinting Strike",
                        "description": "<p>You feint with your mainhand weapon, making a <strong>Deception</strong> attack against the target's <strong>Reflex</strong> defense. You immediately make a <strong>Strike</strong> with your <strong>offhand</strong> weapon.</p><p>If your Deception was successful, you gain <strong>+2 Boons</strong> to your Strike and it deals an additional <strong>+6 Damage</strong>.</p>"
                    }
                }
            }
        },
        "Ferocious Leap": {
            "name": "Ferocious Leap",
            "description": "<p>You leap powerfully into battle to deliver a punishing blow to a nearby enemy with your mainhand weapon.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Ferocious Leap": {
                        "name": "Ferocious Leap",
                        "description": "<p>You leap up to 10 feet and perform a Strike against an enemy within melee range of where you land. Your movement ignores difficult terrain and is not blocked by enemy creatures.</p>"
                    }
                }
            }
        },
        "Flaming Arrow": {
            "name": "Flaming Arrow",
            "description": "<p>You take time to light and loose an arrow covered in flammable pitch. This shot takes longer but is very damaging to either creatures or structures.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Flaming Arrow": {
                        "name": "Flaming Arrow",
                        "description": "<p>You loose a <strong>Empowered</strong> ranged strike using a <strong>Projectile</strong> weapon which deals <strong>Fire</strong> damage upon impact.</p>"
                    }
                }
            }
        },
        "Flash of Steel": {
            "name": "Flash of Steel",
            "description": "<p>You are an expert in using a thrown weapon to imbalance or expose your target for follow-up strikes.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Flash of Steel": {
                        "name": "Flash of Steel",
                        "description": "<p>You make a <strong>Thrown </strong>weapon attack, targeting a weak point in your enemy's defences. If the attack hits, the target becomes <strong>Exposed</strong> until the start of their next Turn.</p>",
                        "effects": [
                            {
                                "name": "Flash of Steel"
                            }
                        ]
                    }
                }
            }
        },
        "Fletching Journeyman": {
            "name": "Fletching Journeyman"
        },
        "Fletching Novice": {
            "name": "Fletching Novice"
        },
        "Flurry": {
            "name": "Flurry",
            "description": "<p>A martial technique using two weapons to overwhelm a single target with a relentless sequence of attacks.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Flurry": {
                        "name": "Flurry",
                        "description": "<p>You <strong>Strike</strong> twice with each weapon, but each strike is <strong>Difficult</strong>.</p>"
                    }
                }
            }
        },
        "Flying Kick": {
            "name": "Flying Kick",
            "description": "An unarmed technique where you launch yourself while running at an enemy in a leaping kick which is empowered to deal additional damage.",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Flying Kick": {
                        "name": "Flying Kick",
                        "description": "<p><strong>Move</strong> forward between 3 feet and 6 feet in a straight line to kick an enemy with an empowered <strong>Strike</strong>.</p>"
                    }
                }
            }
        },
        "Focused Anticipation": {
            "name": "Focused Anticipation",
            "description": "Anticipation leads to decisive action. When you have the highest <strong>Initiative</strong> score for a Round of combat, you gain <strong>+1 Focus</strong>.</p>"
        },
        "Fulcrum": {
            "name": "Fulcrum",
            "description": "<p>Balance, positioning, and leverage are your greatest allies in combat. You know how to use a foe's momentum against them and that a small redirection in force can turn the tide of battle.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Conserve Momentum": {
                        "name": "Conserve Momentum",
                        "condition": "You Block, Parry, or Dodge an incoming melee Strike.",
                        "description": "You redirect the force of a melee attack which misses you, pivoting it to instead hit some other adjacent enemy. Your attacker must re-roll their attack targetting their ally instead."
                    }
                }
            }
        },
        "Gesture: Arrow": {
            "name": "Gesture: Arrow",
            "description": "<p>Hurl a projectile of magical power at a distant target. This might use the Lightning Rune to hurl a lightning bolt, or the Shadow rune to hurl a ball of devouring darkness.</p><p>The Arrow gesture scales using <strong>Intellect</strong> and targets a <strong>single</strong> creature up to a distance of 60 feet, dealing 8 base damage on a successful attack.</p>"
        },
        "Gesture: Aspect": {
            "name": "Gesture: Aspect",
            "description": "<p>Infuse the essence of a Rune into the self, empowering your own physical form or psyche.</p>\n\n<p>When you assume a certain Aspect, you become more closely attuned to the damage type of the Rune used in your spell. You gain <strong>+2 Resistance</strong> to that damage type, and deal an additional <strong>+2 Damage</strong> whenever dealing damage of that type.</p>\n\n<p>Your Aspect lasts for <strong>6 Rounds</strong>. You may only have one active Aspect, casting another spell using the Aspect gesture replaces the previous effect.</p>"
        },
        "Gesture: Create": {
            "name": "Gesture: Create",
            "description": "<p>Coalesce arcane power into tangible form, conjuring a <strong>Creation</strong> which appears within 10 feet and joins Combat at Initiative 1.</p><p>Your Creation is a Minion of half your own Level chosen from the Summoned Creatures compendium pack corresponding to the Rune used in the spell.</p><p>The Creation lasts for <strong>10 Rounds</strong>. You may only have one active Creation, casting another spell using the Create gesture replaces your previous Creation.</p>"
        },
        "Gesture: Fan": {
            "name": "Gesture: Fan",
            "description": "<p>Focus the essence of a rune into a sweeping or splintered arc to strike multiple targets in close proximity. If used with Earth, this might hurl a spray of stone in an arc, while using it with Kinesis might carve a slice across multiple foes.</p><p>The Fan gesture scales using <strong>Intellect</strong> and targets a 120 degree, 6 foot cone, dealing 6 base damage on a successful attack.</p>"
        },
        "Gesture: Influence": {
            "name": "Gesture: Influence",
            "description": "<p>Intensify an arcane phenomenon at close range. Influence could be used with the Flame rune to set a target ablaze or with the Stasis rune to sap their Morale.</p><p>The Influence gesture is a more powerful evolution of the basic Touch gesture that is learned with any Rune.</p><p>The Influence gesture scales using <strong>Presence</strong> and targets a <strong>single</strong> adjacent creature, dealing 10 base damage on a successful attack.</p>"
        },
        "Gesture: Pulse": {
            "name": "Gesture: Pulse",
            "description": "<p>Emit a burst of Runic power in a circular wave that travels outward, with you at its center. A Pulse of Spirit might be used to bolster Morale for your allies, while a Death pulse might be used to deal Corruption damage to a group of enemies gathered around you.</p><p>The Pulse gesture scales using <strong>Presence</strong> and targets a 360 degree, 6 foot radius, dealing 6 base damage on a successful attack.</p>"
        },
        "Gesture: Ray": {
            "name": "Gesture: Ray",
            "description": "<p>Focus the power of a Rune into a single point, expelling its energy into a ranged beam which rapidly travels a short distance to a targeted area. If used with Life this might restore the HP of a distant ally steadily over time, while Frost might emit a beam that freezes a target in place.</p><p>The Ray gesture scales using <strong>Wisdom</strong> and targets a 30 foot line emanating from the caster, dealing 6 base damage on a successful attack.</p>"
        },
        "Gesture: Step": {
            "name": "Gesture: Step",
            "description": "<p>Infuse runic power into a movement, crossing physical and spatial boundaries. Move 20 feet in a straight line, dealing minor damage to enemies or applying restoration to allies in your path.</p><p>The Step gesture scales with <strong>Dexterity</strong> and targets a 20 foot line, dealing 2 base damage on a successful attack.</p>"
        },
        "Gesture: Strike": {
            "name": "Gesture: Strike",
            "description": "<p>Empower a close-range attack with the essence of a Rune. This rune performs a melee weapon attack targeting the defense and dealing damage of the Rune used in the spell.</p><p>The Strike gesture scales using <strong>Strength</strong> and targets a <strong>single</strong> adjacent creature, dealing base damage according to your equipped weapon on a successful attack.</p>"
        },
        "Gesture: Ward": {
            "name": "Gesture: Ward",
            "description": "<p>Focus the power of a Rune into a protective barrier, shielding yourselves and others from harmful effects. When used with the Kinesis rune the Ward reduces incoming damage from a chosen physical damage type while combination with the Death rune protects against Corruption damage.</p>\n<p>Your Ward provides <strong>+6 Resistance</strong> against the damage type of the Rune used in the spell. The Ward lasts for 1 Round.</p>\n<p>You may only have a single Ward at a time. Casting another spell using the Ward gesture replaces your prior Ward.</p>"
        },
        "Gladiator": {
            "name": "Gladiator",
            "description": "<p>Once per Round, you can make a Reaction which incorporates a Strike attack without spending any Focus.</p>"
        },
        "Hamstring": {
            "name": "Hamstring",
            "description": "<p>You use a slashing weapon to target the legs of an enemy and cripple their movement.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Hamstring": {
                        "name": "Hamstring",
                        "description": "<p>You make <strong>Strike</strong> attack which is <strong>Difficult</strong>, but if successful, inflicts the <strong>Slowed</strong> condition for <strong>3 Rounds</strong>.</p>",
                        "effects": [
                            {
                                "name": "Hamstring"
                            }
                        ]
                    }
                }
            }
        },
        "Healer": {
            "name": "Healer",
            "description": "<p>You are unparalleled at manipulating vital arcana to treat injuries. You learn <strong>Rune: Life</strong> if you do not already know it. When healing allies using the Rune of Life you gain <strong>+2 Boons</strong> to your roll.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Font of Life": {
                        "name": "Font of Life",
                        "description": "<p>You bring forth an aura of life-giving magic. Immediately upon activation and at the start of your turn for <strong>3 Rounds</strong> every ally within 20 feet heals for an amount equal to your <strong>Wisdom</strong> score.</p>",
                        "effects": [
                            {
                                "name": "Font of Life"
                            }
                        ]
                    }
                }
            }
        },
        "Heavy Strike": {
            "name": "Heavy Strike",
            "description": "<p>You know how to use a heavy weapon to deliver punishing blows, putting your entire strength behind every swing.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Heavy Strike": {
                        "name": "Heavy Strike",
                        "description": "<p>You unleash a powerful <strong>Strike</strong> with your mainhand weapon. The attack is slower to execute, but is <strong>Empowered</strong> to deliver additional damage.</p>"
                    }
                }
            }
        },
        "Heavy Weapon Proficiency": {
            "name": "Heavy Weapon Proficiency",
            "description": "<p>You have a fluent education in the use of martial weaponry. You gain the <strong>Journeyman</strong> training rank and a <strong>+1 Skill Bonus</strong> with weapons in the <strong>Simple</strong>, <strong>Heavy</strong>, and <strong>Balanced</strong> categories.</p>"
        },
        "Heavy Weapon Training": {
            "name": "Heavy Weapon Training",
            "description": "<p>You have a basic education in the use of martial weaponry. You are no longer treated as <strong>Untrained</strong> with weapons in the <strong>Heavy</strong>, or <strong>Balanced</strong> categories.</p>"
        },
        "Hold Fast": {
            "name": "Hold Fast",
            "description": "<p>You are a calm anchor in the swirling sea of combat. Your <strong>Engagement</strong> increases by +1, allowing you to simultaneously engage more adjacent foes.</p>"
        },
        "Impetus": {
            "name": "Impetus",
            "description": "<p>You are gifted at exploiting the slowness with which others think. If you are first in Initiative order during a round of Combat, you gain +1 current and maximum Action.</p>"
        },
        "Inflection: Compose": {
            "name": "Inflection: Compose",
            "description": "<p>Enhance a spell by taking extra time in its formation, reducing other resource costs in exchange. The Compose inflection reduces the <strong>Focus</strong> cost of a spell by 1 while increasing its <strong>Action</strong> cost by 1 in exchange.</p>"
        },
        "Inflection: Determine": {
            "name": "Inflection: Determine",
            "description": "<p>Enhance a spell to make it more difficult to counter. Any attempt to Counter-Spell this spell is made with +2 Banes.</p>"
        },
        "Inflection: Elude": {
            "name": "Inflection: Elude",
            "description": "<p>Enhance a spell to make it more difficult for an enemy to retaliate against its casting. This spell does not provide any opportunity to make reactions that involve Strike attacks, regardless of the results of the spell.</p>"
        },
        "Inflection: Extend": {
            "name": "Inflection: Extend",
            "description": "<p>Enhance the duration of a spell, increasing the duration of its effect. For spells which are instantaneous, any corresponding status conditions that they cause are increased in duration.</p><section class=\"construction\"><p>Effect duration increases from the Extend inflection are not yet automated in Playtest 1. This inflection is included as an example of the intended direction for the Spellcraft system.</p></section>"
        },
        "Inflection: Negate": {
            "name": "Inflection: Negate",
            "description": "<p>Invert the effect of a spell. An Inverted Life Touch spell which normally heals a target deals Poison damage instead. An Inverted Death Ward spell inflicts vulnerability to Corruption damage upon an adjacent enemy.</p><section class=\"construction\"><p>The effects of the Negate inflection are not yet automated for Playtest 1. This inflection is included as an example of the intended direction for the Spellcraft system.</p></section>"
        },
        "Inflection: Pull": {
            "name": "Inflection: Pull",
            "description": "<p>Empower a spell to attract affected creatures toward the caster. Creatures affected by a spell with the Pull inflection move 1 space closer towards the spellcaster if that destination space is unoccupied.</p>"
        },
        "Inflection: Push": {
            "name": "Inflection: Push",
            "description": "<p>Empower a spell to repel affected creatures away from the caster. Creatures affected by a spell with the Push inflection move 1 space away from the spellcaster if that destination space is unoccupied.</p>"
        },
        "Inflection: Quicken": {
            "name": "Inflection: Quicken",
            "description": "<p>Enhance a spell by hastening the speed with which it can be cast, at the expense of increased Focus. The Quicken inflection reduces the <strong>Action</strong> cost of a spell by 1 while increasing its <strong>Focus</strong> cost by 1 in exchange.</p>"
        },
        "Inflection: Reshape": {
            "name": "Inflection: Reshape",
            "description": "<p>Enhance a Spell by carefully reshaping and controlling its area of effect at the cost of <strong>2 Focus</strong>.</p><p>Offensive spells which use a template target only target enemies within the area. Healing spells which use a template target only target allies within the area.</p><p>Single target spells do not incur any Banes due to intervening creatures.</p>"
        },
        "Inquisitor": {
            "name": "Inquisitor",
            "description": "<p>You are an expert in combat against magic users. You know how to conserve energy and strike at the precise moment to thwart their incantation.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Inquisitor's Strike": {
                        "name": "Inquisitor's Strike",
                        "condition": "Your target is casting a spell.",
                        "description": "When an enemy within your Engagement radius whom you can see casts a spell, you may react to Strike that target. On a Critical Hit the target's spell is interrupted and the magic is lost."
                    }
                }
            }
        },
        "Inspirator": {
            "name": "Inspirator",
            "description": "<p>You are highly skilled in weaving the Rune of Spirit. Spells which use this Rune cause the Inspired condition on Critical Hits.</p><p>The Inspired effect lasts for 1 Round and deals your Presence score as restoration to Morale.</p>"
        },
        "Inspire Heroism": {
            "name": "Inspire Heroism",
            "description": "Your courageous presence inspires your nearby allies to strike with confidence.",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Inspire Heroism": {
                        "name": "Inspire Heroism",
                        "description": "<p>Each ally, excluding yourself, within <strong>10 Feet</strong> gains <strong>+1 Boon</strong> to actions performed until the end of their next Turn.</p>",
                        "effects": [
                            {
                                "name": "Inspire Heroism"
                            }
                        ]
                    }
                }
            }
        },
        "Intellectual Superiority": {
            "name": "Intellectual Superiority",
            "description": "It is sometimes a marvel how slowly others around you think. You gain <strong>+1 Boon</strong> on any Strike or Spell attack against an enemy lower than you in Initiative order."
        },
        "Intercept": {
            "name": "Intercept",
            "description": "You protect your allies, intercepting blows that might otherwise be directed towards your companions.",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Intercept": {
                        "name": "Intercept",
                        "condition": "An enemy moves into or through your Engagement radius.",
                        "description": "<p>You intercept the path of an enemy which enters your <strong>Engagement</strong> radius, immediatly moving up to your <strong>Stride</strong> to interpose yourself and block their path.</p><p>If the enemy moves out of your Engagement radius or attacks any other creature during their turn, you may make a <strong>Disengagement Strike</strong> against them.</p>"
                    }
                }
            }
        },
        "Interrupting Throw": {
            "name": "Interrupting Throw",
            "description": "<p>You are alert and prepared to use your equipped weapon to interrupt enemy spellcraft.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Interrupting Throw": {
                        "name": "Interrupting Throw",
                        "condition": "An enemy you can see casts a Spell which costs 3 Action or greater.",
                        "description": "<p>When an enemy that you can see casts a <strong>Spell</strong> which costs <strong>3 Action</strong> or greater, you can make a <strong>Reaction</strong> to perform a <strong>Thrown</strong> weapon attack against the caster. If your attack results in a <strong>Critical Hit</strong> the spell is interrupted and its magic is lost.</p>"
                    }
                }
            }
        },
        "Intimidation Adept": {
            "name": "Intimidation Adept",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You gain the <strong>Adept </strong>rank in the <strong>Intimidation </strong>skill, providing a <strong>+2 Skill Bonus</strong>.</span></p>"
        },
        "Intimidation Journeyman": {
            "name": "Intimidation Journeyman",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You gain the <strong>Journeyman </strong>rank in the <strong>Intimidation </strong>skill, providing a <strong>+1 Skill Bonus</strong>.</span></p>"
        },
        "Intimidation Master": {
            "name": "Intimidation Master",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You gain the <strong>Master </strong>rank in the <strong>Intimidation </strong>skill, providing a <strong>+3 Skill Bonus</strong>.</span></p>"
        },
        "Intimidation Novice": {
            "name": "Intimidation Novice",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You understand the fundamentals of how threats and coercion can achieve desired outcomes. You gain the <strong>Novice</strong> rank in the <strong>Intimidation </strong>skill and are no longer considered <strong>Untrained</strong> in that skill.</span></p><p><span style=\"font-family:Vollkorn, serif\">You know how to use simple displays of violence or overt threats to get others to follow your lead, but you aren't very subtle.</span></p>"
        },
        "Intimidator": {
            "name": "Intimidator",
            "description": "You specialize in exerting your intimidating presence to break the morale of your foes.",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Intimidate": {
                        "name": "Intimidate",
                        "description": "<p>You physically intimidate an enemy that is within your engagement range, performing an Intimidation skill attack against your target. On a success they sustain Void damage to Morale.</p>"
                    }
                }
            }
        },
        "Intuit Weakness": {
            "name": "Intuit Weakness",
            "description": "<p>You calm your mind and study the physiology of your foe, seeking a vulnerability in its defenses.</p><p>Perform a <strong>Knowledge Test</strong> using an appropriate Skill chosen by the Gamemaster. On a success, you learn the Damage type that the creature has the greatest vulnerability towards, if any. On a Critical Success you learn the two Damage types which have the largest vulnerability.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Intuit Weakness": {
                        "name": "Intuit Weakness",
                        "description": "<p>You still your mind and study the physiology of your foe, attempting to identify a vulnerability in its defenses.</p>"
                    }
                }
            }
        },
        "Iramancer": {
            "name": "Iramancer",
            "description": "Your feats of arcana are fueled by anger. While Enraged you may still spend Focus and you deal 2 additional damage to all spell attacks."
        },
        "Irrepressible Spirit": {
            "name": "Irrepressible Spirit",
            "description": "Your tenacity gives you an irrepressible spirit which resists the onset of despair. At the start of your turn if you are not Broken you gain 1 Morale."
        },
        "Jewelcraft Journeyman": {
            "name": "Jewelcraft Journeyman"
        },
        "Jewelcraft Novice": {
            "name": "Jewelcraft Novice"
        },
        "Justiciar": {
            "name": "Justiciar",
            "description": "<p>You are an instrument of justice. Critical Strike attacks also deal the Overflow portion of damage to enemy Morale.</p>"
        },
        "Leg Sweep": {
            "name": "Leg Sweep",
            "description": "<p>You use a weapon which scales using <strong>Strength </strong>to sweep your enemy off balance, swinging low to knock them from their feet.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Leg Sweep": {
                        "name": "Leg Sweep",
                        "description": "<p>You make a <strong>Strike</strong> attack with your mainhand weapon. This technique is <strong>Difficult</strong> to execute and deals reduced damage, but if successful renders your target <strong>Prone</strong>.</p>",
                        "effects": [
                            {
                                "name": "Leg Sweep"
                            }
                        ]
                    }
                }
            }
        },
        "Legerdemain": {
            "name": "Legerdemain",
            "description": "You can silently alter your spellcraft. You can apply Lesser Inflections using only your hands without the need for vocalization."
        },
        "Lesser Regeneration": {
            "name": "Lesser Regeneration",
            "description": "<p>Your prodigious hardiness conveys a supernatural capability to recover from wounds quickly. At the start of your turn if you are not Weakened you gain <strong>+1 Health</strong>.</p>"
        },
        "Light Weapon Proficiency": {
            "name": "Light Weapon Proficiency",
            "description": "<p>You have a fluent education in the use of martial weaponry. You gain the <strong>Journeyman</strong> training rank and a <strong>+1 Skill Bonus</strong> with weapons in the <strong>Light</strong> and <strong>Balanced</strong> categories.</p>"
        },
        "Light Weapon Training": {
            "name": "Light Weapon Training",
            "description": "<p>You have a basic education in the use of finesse weaponry. You are no longer treated as <strong>Untrained</strong> with weapons in the <strong>Light</strong> and <strong>Balanced</strong> categories.</p>"
        },
        "Lightbringer": {
            "name": "Lightbringer",
            "description": "<p>You are highly skilled in weaving the Rune of Illumination. Spells which use this Rune cause the Irradiated condition on Critical Hits.</p><p>The Irradiated effect lasts for 1 Round and deals your Presence score as Radiant damage to both Health and Morale.</p>"
        },
        "Lunge": {
            "name": "Lunge",
            "description": "You dart forward nimbly, making a strike with sudden and unexpected swiftness.",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Lunge": {
                        "name": "Lunge",
                        "description": "<p>You <strong>Strike</strong> with your mainhand weapon against a single foe with an increased range of <strong>+2 feet</strong>. The attack is <strong>Difficult</strong>, but you do not move from your current position nor does this attack provoke any Disengagement.</p>"
                    }
                }
            }
        },
        "Mark Prey": {
            "name": "Mark Prey",
            "description": "You fire a special shot which deals reduced damage, but explodes in luminous powder clearly marking your target.",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Mark Prey": {
                        "name": "Mark Prey",
                        "description": "<p>You Strike using a special shot. If your attack is successful the target is <strong>Exposed</strong> for the next 3 Turns.</p>",
                        "effects": [
                            {
                                "name": "Marked"
                            }
                        ]
                    }
                }
            }
        },
        "Martial Artist": {
            "name": "Martial Artist",
            "description": "You have honed your body into a dangerous weapon. Your bare fists are treated as weapons of Fine quality, increasing their damage by +1."
        },
        "Mechanical Weapon Proficiency": {
            "name": "Mechanical Weapon Proficiency",
            "description": "<p>You have a fluent education in the use of crossbows, firearms, and other mechanical weapons. You gain the <strong>Journeyman</strong> training rank and a <strong>+1 Skill Bonus</strong> with weapons in the <strong>Mechanical</strong> category.</p>"
        },
        "Mechanical Weapon Training": {
            "name": "Mechanical Weapon Training",
            "description": "<p>You have a basic education in crossbows, firearms, and other mechanical weapons. You are no longer treated as <strong>Untrained</strong> with weapons in the <strong>Mechanical </strong>category.</p>"
        },
        "Medicine Adept": {
            "name": "Medicine Adept",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You gain the <strong>Adept </strong>rank in the <strong>Medicine </strong>skill, providing a <strong>+2 Skill Bonus</strong>.</span></p>"
        },
        "Medicine Journeyman": {
            "name": "Medicine Journeyman",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You gain the <strong>Journeyman </strong>rank in the <strong>Medicine </strong>skill, providing a <strong>+1 Skill Bonus</strong>.</span></p>"
        },
        "Medicine Master": {
            "name": "Medicine Master",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You gain the <strong>Master </strong>rank in the <strong>Medicine </strong>skill, providing a <strong>+3 Skill Bonus</strong>.</span></p>"
        },
        "Medicine Novice": {
            "name": "Medicine Novice",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You have a basic education in anatomy, physiology, and medicine. You gain the <strong>Novice</strong> rank in the <strong>Medicine </strong>skill and are no longer considered <strong>Untrained</strong> in that skill.</span></p><p><span style=\"font-family:Vollkorn, serif\">Youve learned the basics of treating common wounds and illnesses, and keep a running list of known alchemical and herbal compounds that can be used for treating particular illnesses. With a little time studying an injured, diseased, or otherwise ill individual you can perform a basic diagnosis and treat accordingly.</span></p>"
        },
        "Mender": {
            "name": "Mender",
            "description": "<p>You are highly skilled in weaving the Rune of Life. Spells which use this Rune cause the Mending condition on Critical Hits.</p><p>The Mending effect lasts for 1 Round and deals your Wisdom score as restoration to Health.</p>"
        },
        "Mental Fortress": {
            "name": "Mental Fortress",
            "description": "Your strong will makes you exceedingly difficult to influence. You gain +1 to your Willpower defense and +5 Psychic resistance."
        },
        "Mesmer": {
            "name": "Mesmer",
            "description": "<p>You are highly skilled in weaving the Rune of Control. Spells which use this Rune cause the Confusion condition on Critical Hits.</p><p>The Confusion effect lasts for 1 Round, deals half your Intellect score as Psychic damage to Morale, and applies the Disoriented condition.</p>"
        },
        "Mnemonic Realization": {
            "name": "Mnemonic Realization",
            "description": "<p>Your sharpened mind is full of secrets and techniques to remember them. Once per Day you may focus your thoughts and attempt to recall a word that sparks your memory.</p>\n<p>The Gamemaster must provide you with a one-word clue that is appropriate for your direction of inquiry. It is left to Gamemaster discretion how direct or vague to be with the clue they provide.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Mnemonic Realization": {
                        "name": "Mnemonic Realization",
                        "description": "<p>You survey your memories attempting to recall a clue for your current situation.</p>"
                    }
                }
            }
        },
        "Monk": {
            "name": "Monk",
            "description": "<p>You balance monastic discipline with expertise in martial arts, balancing attack and defense in harmony.</p><p>While Unarmored, you gain a +2 bonus to your Reflex and Willpower defenses.</p><p>While Unarmed you can use the Double Punch action.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Double Punch": {
                        "name": "Double Punch",
                        "description": "You Strike twice in the blink of an eye, punching with both arms."
                    }
                }
            }
        },
        "Natural Weapon Proficiency": {
            "name": "Natural Weapon Proficiency",
            "description": "<p>You have a fluent familiarity with the use of natural bodily weapons. You gain the <strong>Journeyman</strong> training rank and a <strong>+1 Skill Bonus</strong> with weapons in the <strong>Natural </strong>category.</p>"
        },
        "Natural Weapon Training": {
            "name": "Natural Weapon Training",
            "description": "<p>You have a developed familiarity with using features of your own body as a natural weapons including claws, jaws, tails, or other mechanisms of self-defense. You are no longer treated as <strong>Untrained</strong> with weapons in the <strong>Natural</strong> category.</p>"
        },
        "Necromancer": {
            "name": "Necromancer",
            "description": "<p>You are highly skilled in weaving the Rune of Death. Spells which use this Rune cause the Corrupted condition on Critical Hits.</p><p>The Corrupted effect lasts for 3 Rounds and deals your Intellect score as Corruption damage to Health each Round.</p>"
        },
        "Nosferatu": {
            "name": "Nosferatu",
            "description": "<p>You are afflicted with a rare blood mutation which allows your wounds to rapidly heal through hematophagy.</p><p>You can restore your Health by biting a living target. This attack is made with a Superior Natural weapon which scales using Strength and deals Piercing damage.</p><p>Your vulnerability to Radiant damage increases by 10.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Vampiric Bite": {
                        "name": "Vampiric Bite",
                        "condition": "Your target is a living creature.",
                        "description": "<p>You grasp an enemy and bite it with sharp incisors, rapidly draining its blood to heal your own wounds. This attack requires a free hand to grasp your target while you feed.</p>"
                    }
                }
            }
        },
        "Operator": {
            "name": "Operator",
            "description": "<p>You have ice in your veins and remain cool under pressure. Your physical toughness and mental acuity allow you to hone the danger of your situation to achieve the greatest results when the stakes are highest.</p><p>While in combat and not Incapacitated, you gain +1 Boon to all checks when you have less than 50% of your maximum Health remaining. You gain +2 Boons to all checks when you have less than 25% of your maximum Health remaining.</p>"
        },
        "Opportunist": {
            "name": "Opportunist",
            "description": "<p>You sieze any opportunity you can to capitalize on an enemy who turns their back on you. You may make a <strong>Disengagement Attack</strong> even if you are otherwise <strong>Fully Engaged</strong>, but you do so without the 2 Boons that would ordinarily apply to such an attack.</p>"
        },
        "Opportunistic Spellcraft": {
            "name": "Opportunistic Spellcraft",
            "description": "<p>Your quick thinking can weave magic to exploit brief windows of opportunity. You may make a <strong>Disengagement Attack</strong> using the <strong>Touch</strong> Gesture instead of a melee weapon attack.</p>"
        },
        "Overwatch": {
            "name": "Overwatch",
            "description": "<p>You are an expert in combat against magic users. You know how to conserve energy and strike at the precise moment to thwart their incantation.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Disrupting Shot": {
                        "name": "Disrupting Shot",
                        "condition": "Your target is casting a spell.",
                        "description": "When an enemy you can see casts a spell, you may react to Strike that target. The technique is difficult to perform, but on a Critical Hit the target's spell is interrupted and the magic is lost."
                    }
                }
            }
        },
        "Patient Deflection": {
            "name": "Patient Deflection",
            "description": "Your expertise with martial arts allows you to dodge or deflect blows as effectively as a heavily armored fighter. While unarmed, half your Wisdom score contributes to your Parry defense."
        },
        "Penetrating Shot": {
            "name": "Penetrating Shot",
            "description": "You load special ammunition which deals less damage but penetrates directly through a line of targets.",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Penetrating Shot": {
                        "name": "Penetrating Shot",
                        "description": "<p>You fire a shot which penetrates through multiple targets in a direct line.</p>"
                    }
                }
            }
        },
        "Penetrating Throw": {
            "name": "Penetrating Throw",
            "description": "<p>You can hurl your weapon with such ferocity that it strikes all targets in a direct line.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Penetrating Throw": {
                        "name": "Penetrating Throw",
                        "description": "<p>You perform a <strong>Throw</strong> weapon strike which penetrates to hit all enemies in a straight line.</p>"
                    }
                }
            }
        },
        "Performance Adept": {
            "name": "Performance Adept",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You gain the <strong>Adept </strong>rank in the <strong>Performance </strong>skill, providing a <strong>+2 Skill Bonus</strong>.</span></p>"
        },
        "Performance Journeyman": {
            "name": "Performance Journeyman",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You gain the <strong>Journeyman </strong>rank in the <strong>Performance </strong>skill, providing a <strong>+1 Skill Bonus</strong>.</span></p>"
        },
        "Performance Master": {
            "name": "Performance Master",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You gain the <strong>Master </strong>rank in the <strong>Performance </strong>skill, providing a <strong>+3 Skill Bonus</strong>.</span></p>"
        },
        "Performance Novice": {
            "name": "Performance Novice",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You have learned the basic practices of art and entertainment. You gain the <strong>Novice</strong> rank in the <strong>Performance </strong>skill and are no longer considered <strong>Untrained</strong> in that skill.</span></p><p><span style=\"font-family:Vollkorn, serif\">You know a few common dances, have a collection of well-known tales, and you could probably sing or play a few popular songs. You may be trained in an instrument or two, and your capability with a brush or pen is reasonable enough that you could probably create a passable work of art.</span></p>"
        },
        "Perspicacity": {
            "name": "Perspicacity",
            "description": "<p>You have heightened insight into aspects of your surroundings. You gain +2 Boons to any <strong>Awareness</strong> skill test which does not rely upon eyesight.</p>"
        },
        "Pinning Shot": {
            "name": "Pinning Shot",
            "description": "You fire a tactically placed shot to pin your target against a nearby surface.",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Pinning Shot": {
                        "name": "Pinning Shot",
                        "description": "<p>You <strong>Strike</strong> from distance. The attack is <strong>Difficult</strong>, however if your target is it it becomes <strong>Restrained</strong> until the end of their next Turn.</p>",
                        "effects": [
                            {
                                "name": "Pinning Shot"
                            }
                        ]
                    }
                }
            }
        },
        "Pistoleer": {
            "name": "Pistoleer",
            "description": "<p>Your familiarity with mechanical firearms is unmatched. You can perform the Reload action for free once per Round.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Salvo": {
                        "name": "Salvo",
                        "description": "You fire a barrage of attacks using a one-handed mechanical weapon, shooting three times at a target without the need to reload in-between shots."
                    }
                }
            }
        },
        "Planned Defense": {
            "name": "Planned Defense",
            "description": "You exert strong battlefield judgment to prepare your defenses against the attacks of your foes. Any enemy which acts after you in <strong>Initiative</strong> order suffers 1 Bane to their spell or weapon attacks against you."
        },
        "Poisoner": {
            "name": "Poisoner",
            "description": "<p>You can apply Poison to weapons which deal Slashing or Piercing damage. You deal an additional +2 damage whenever you deal Poison damage and your Strikes cause the <strong>Poisoned</strong> condition on Critical Strikes which deal damage to Health.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Poison Blades": {
                        "name": "Poison Blades",
                        "description": "You nimbly lather your blades in toxic alchemical oils which apply the Poisoned condition on Critical Strikes.",
                        "effects": [
                            {
                                "name": "Poison Blades"
                            }
                        ]
                    }
                }
            }
        },
        "Powerful Physique": {
            "name": "Powerful Physique",
            "description": "You can wield weapons with the Slow trait and wear Armor with the Bulky trait without suffering Banes to your Initiative rolls."
        },
        "Powerful Throw": {
            "name": "Powerful Throw",
            "description": "<p>The maximum range at which you can use <strong>Throw Weapon</strong> is doubled.</p>"
        },
        "Precision Shot": {
            "name": "Precision Shot",
            "description": "You take time to steady your aim and target the weakest point of a foe. You may only get one shot, but you make it count.",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Precision Shot": {
                        "name": "Precision Shot",
                        "description": "<p>You steady your aim and fire a single accurate shot.</p>"
                    }
                }
            }
        },
        "Preparedness": {
            "name": "Preparedness",
            "description": "You seem to always be prepared for the moment at hand. You may sacrifice your free movement for the Round to instead equip an Item from your inventory without spending any Action points."
        },
        "Preternatural Instinct": {
            "name": "Preternatural Instinct",
            "description": "Your quickness of mind and body are equally impressive. You gain +2 Boons to all Initiative checks."
        },
        "Projectile Weapon Proficiency": {
            "name": "Projectile Weapon Proficiency",
            "description": "<p>You have a fluent education in the use of projectile weaponry. You gain the <strong>Journeyman</strong> training rank and a <strong>+1 Skill Bonus</strong> with weapons in the <strong>Projectile</strong> category.</p>"
        },
        "Projectile Weapon Training": {
            "name": "Projectile Weapon Training",
            "description": "<p>You have a basic education in archery and other projectile weaponry. You are no longer treated as <strong>Untrained</strong> with weapons in the <strong>Projectile </strong>categories.</p>"
        },
        "Provocateur": {
            "name": "Provocateur",
            "description": "You specialize in barbed repartee crafted to highlight your opponent's shortcomings. In combat you can launch quips which provoke your foes.",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Scathing Mockery": {
                        "name": "Scathing Mockery",
                        "condition": "Your target can hear and understand you.",
                        "description": "You exaggerate your opponent's shortcomings with a scathing bon mot, performing a Diplomacy skill attack against your target's Willpower. On a success they suffer modest Psychic damage to Morale and become Enraged for 1 Round.",
                        "effects": [
                            {
                                "name": "Scathing Mockery"
                            }
                        ]
                    }
                }
            }
        },
        "Pyromancer": {
            "name": "Pyromancer",
            "description": "<p>You are highly skilled in weaving the Rune of Flame. Spells which use this Rune cause Burning on Critical Hits.</p><p>The Burning effect lasts for 1 Round and deals your Intellect score as Fire damage to both Health and Morale.</p>"
        },
        "Rallying Cry": {
            "name": "Rallying Cry",
            "description": "You are a battlefield leader, using your presence and voice to harden the resolve of your allies.",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Rallying Cry": {
                        "name": "Rallying Cry",
                        "description": "<p>You emit a courageous bellow that inspires Allies within 12 feet of you to remain stalwart in the face of danger. You perform an Intimidation skill test against the Madness threshold of your allies. On a success, affected allies become Resolute for one Round.</p>",
                        "effects": [
                            {
                                "name": "Rallying Cry"
                            }
                        ]
                    }
                }
            }
        },
        "Rapid Reload": {
            "name": "Rapid Reload",
            "description": "You focus deeply and calm your nerves to reload your mechanical weapon with exceptional haste.",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Rapid Reload": {
                        "name": "Rapid Reload",
                        "description": "<p>You quickly reload your mechanical weapon.</p>"
                    }
                }
            }
        },
        "Recognize Spellcraft": {
            "name": "Recognize Spellcraft",
            "description": "<p>You can interpret the arcane incantations of others to discern the nature of their spellcraft. When an enemy within 40 feet that you can see and hear begins casting a spell, you can identify its Rune if you have mastered that Rune.</p>"
        },
        "Repercussive Block": {
            "name": "Repercussive Block",
            "description": "<p>You can channel explosive force into a counter-bash which can disarm your opponent when blocking with your shield.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Repercussive Block": {
                        "name": "Repercussive Block",
                        "condition": "You Block a Melee attack with an equipped shield.",
                        "description": "<p>When you <strong>Block</strong> a <strong>Melee</strong> attack, you can react to counter-attack with your equipped shield. This technique is <strong>Harmless</strong> but, if successful, will disarm your opponent forcing their weapon to be <strong>Dropped</strong>.</p>"
                    }
                }
            }
        },
        "Resilient": {
            "name": "Resilient",
            "description": "<p>Your body responds eagerly to healing, demonstrating a remarkable ability to recover from wounds.</p>\n<p>Your <strong>Wounds Threshold</strong> is reduced by 1, making you easier to heal.</p>"
        },
        "Rimecaller": {
            "name": "Rimecaller",
            "description": "<p>You are highly skilled in weaving the Rune of Frost. Spells which use this Rune cause the Chilled condition on Critical Hits.</p><p>The Chilled effect lasts for 1 Round, deals half your Wisdom score as Frost damage to Health, and applies the Slowed condition.</p>"
        },
        "Rune: Control": {
            "name": "Rune: Control",
            "description": "<p>The orderly force of discipline and the mind. The Control rune governs thought, logic and reason. It is opposed by the chaotic rune of Spirit.</p>\n<p>The Control rune scales using <strong>Intellect</strong>, targets <strong>Willpower</strong>, and deals <strong>Psychic</strong> damage to <strong>Morale</strong>.</p>"
        },
        "Rune: Death": {
            "name": "Rune: Death",
            "description": "<p>The orderly force of destruction, responsible for the decay of all matter. The Death rune governs decay and destruction. It is opposed by the chaotic rune of Life.</p>\n<p>The Death rune scales using <strong>Intellect</strong>, targets <strong>Fortitude</strong>, and deals <strong>Corruption</strong> damage to <strong>Health</strong>.</p>"
        },
        "Rune: Earth": {
            "name": "Rune: Earth",
            "description": "<p>The orderly force of elemental earth, responsible for physical matter. The Earth rune governs health and matters relating to biological growth. It is opposed by the chaotic rune of Lightning.</p>\n<p>The Earth rune scales using <strong>Wisdom</strong>, targets <strong>Reflex</strong>, and deals <strong>Acid</strong> damage to <strong>Health</strong>.</p>"
        },
        "Rune: Flame": {
            "name": "Rune: Flame",
            "description": "<p>The chaotic force of elemental, thermal energy. The Flame rune governs fire and heat. It is opposed by the orderly rune of Frost.</p>\n<p>The Flame rune scales using <strong>Intellect</strong>, targets <strong>Reflex</strong>, and deals <strong>Fire</strong> damage to <strong>Health</strong>.</p>"
        },
        "Rune: Frost": {
            "name": "Rune: Frost",
            "description": "<p>The orderly force of elemental, thermal energy. The Frost rune governs sources of ice and cold. It is opposed by the chaotic rune of Flame.</p>\n<p>The Frost rune scales using <strong>Wisdom</strong>, targets <strong>Fortitude</strong>, and deals <strong>Cold</strong> damage to <strong>Health</strong>.</p>"
        },
        "Rune: Illumination": {
            "name": "Rune: Illumination",
            "description": "<p>The chaotic force of light and positive energy. The Illumination rune governs light and all of its properties. It is opposed by the orderly rune of Shadow.</p>\n<p>The Illumination rune scales using <strong>Presence</strong>, targets <strong>Willpower</strong>, and deals <strong>Radiant</strong> damage to <strong>Health</strong>.</p>"
        },
        "Rune: Kinesis": {
            "name": "Rune: Kinesis",
            "description": "<p>The chaotic force of space and physical movement. The Kinesis rune governs all things related to the act of movement and physicality. It is opposed by the orderly rune of Stasis.</p>\n<p>The Kinesis rune scales using <strong>Presence</strong>, targets <strong>Physical</strong> defense, and deals <strong>Bludgeoning</strong>, <strong>Piercing</strong>, or <strong>Slashing</strong> damage to <strong>Health</strong>.</p>"
        },
        "Rune: Life": {
            "name": "Rune: Life",
            "description": "<p>The chaotic force of creation, responsible for all living matter. The Life rune governs health and matters relating to biological growth. It is opposed by the orderly rune of Death.</p>\n<p>The Life rune scales using <strong>Wisdom</strong> and provides <strong>Restoration</strong> of <strong>Health</strong>.</p>"
        },
        "Rune: Lightning": {
            "name": "Rune: Lightning",
            "description": "<p>The chaotic force of raw, electrical energy. The Lightning rune governs sources of electrical energy and electrical discharge. It is opposed by the orderly rune of Earth.</p>\n<p>The Lightning rune scales using <strong>Intellect</strong>, targets <strong>Reflex</strong>, and deals <strong>Electrical</strong> damage to <strong>Health</strong>.</p>"
        },
        "Rune: Shadow": {
            "name": "Rune: Shadow",
            "description": "<p>The orderly force of darkness and negative energy. The Shadow rune governs darkness and all of its properties. It is opposed by the chaotic rune of Illumination.</p>\n<p>The Shadow rune scales using <strong>Presence</strong>, targets <strong>Fortitude</strong>, and deals <strong>Void</strong> damage to <strong>Morale</strong>.</p>"
        },
        "Rune: Spirit": {
            "name": "Rune: Spirit",
            "description": "<p>The chaotic force of emotion and willfulness. The Spirit rune governs matters related to emotional well-being as well as the soul. It is opposed by the orderly rune of Control.</p>\n<p>The Spirit rune scales using <strong>Presence</strong> and provides <strong>Restoration</strong> of <strong>Morale</strong>.</p>"
        },
        "Rune: Stasis": {
            "name": "Rune: Stasis",
            "description": "<p>The orderly force of immutability and potential energy. The Stasis rune governs all things related to permanence and resistance to change. It is opposed by the chaotic rune of Kinesis.</p>\n<p>The Stasis rune scales using <strong>Wisdom</strong>, targets <strong>Physical</strong> defense, and deals <strong>Bludgeoning</strong>, <strong>Piercing</strong>, or <strong>Slashing</strong> damage to <strong>Morale</strong>.</p>"
        },
        "Runewarden": {
            "name": "Runewarden",
            "description": "<p>Your mastery of the arcane makes you more resilient to elemental and spiritual harm. You gain a bonus to <strong>Resistance</strong> equal to half your Wisdom for each Elemental or Spiritual damage type where you know the Arcane Rune attuned to that damage type.</p><p>When you use the <strong>Ward</strong> gesture, the Resistance provided by your Ward also increases by half your Wisdom.</p>"
        },
        "Runeweaving Journeyman": {
            "name": "Runeweaving Journeyman"
        },
        "Runeweaving Novice": {
            "name": "Runeweaving Novice"
        },
        "Ruthless Momentum": {
            "name": "Ruthless Momentum",
            "description": "<p>You relish the carnage you can cause in combat and continue to press the fray as each enemy falls.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Ruthless Momentum": {
                        "name": "Ruthless Momentum",
                        "condition": "You incapacitate an enemy with a melee attack.",
                        "description": "<p>After defeating an enemy, you may move up to your <strong>Stride</strong> and attack another foe within melee range.</p>"
                    }
                }
            }
        },
        "Safecracker": {
            "name": "Safecracker",
            "description": "<p>You are skilled in the arts of disarming traps and picking locks. You gain +1 Boon on <strong>Stealth</strong> checks to disable a device or open a lock.</p>"
        },
        "Science Adept": {
            "name": "Science Adept",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You gain the <strong>Adept </strong>rank in the <strong>Science </strong>skill, providing a <strong>+2 Skill Bonus</strong>.</span></p>"
        },
        "Science Journeyman": {
            "name": "Science Journeyman",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You gain the <strong>Journeyman </strong>rank in the <strong>Science </strong>skill, providing a <strong>+1 Skill Bonus</strong>.</span></p>"
        },
        "Science Master": {
            "name": "Science Master",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You gain the <strong>Master </strong>rank in the <strong>Science </strong>skill, providing a <strong>+3 Skill Bonus</strong>.</span></p>"
        },
        "Science Novice": {
            "name": "Science Novice",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You've learned to study the world around you through structured observation, mathematics, physics, chemistry, and other disciplines. You gain the <strong>Novice</strong> rank in the <strong>Science </strong>skill and are no longer considered <strong>Untrained</strong> in that skill.</span></p><p><span style=\"font-family:Vollkorn, serif\">You are familiar with the basic principles of mathematics, physics, chemistry, or other scientific studies. You know how to construct and use simple machines for the purposes of making physical tasks easier. You know some of the more commonly understood scientific theories, and given suitable time to study more complex machines you might be able to at least operate them.</span></p>"
        },
        "Seasoned Veteran": {
            "name": "Seasoned Veteran",
            "description": "<p>You battlefield experience makes you accustomed to engaging multiple foes. Your <strong>Engagement</strong> increases by +1, allowing you to simultaneously engage more adjacent foes.</p>"
        },
        "Second Wind": {
            "name": "Second Wind",
            "description": "Your physical hardiness allows you to push yourself beyond conventional limits.",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Second Wind": {
                        "name": "Second Wind",
                        "description": "<p>You focus your energy and recover your Toughness score in Health.</p>"
                    }
                }
            }
        },
        "Shapeshifter": {
            "name": "Shapeshifter",
            "description": "<p>You possess supernatural ability to transform your body into the shapes of beasts.</p><p>You undergo a transformation where you assume the form of a beast that you are familiar with and which is half your level or less. While transformed you have the exact attributes and abilities of the chosen beast.</p><p>Your equipment is magically incorporated into the form that you take, however you gain no benefit from that equipment while transformed.</p><p>If your bestial form becomes Incapacitated you revert back to your normal form with any excess damage becoming Wounds. If your Morale is Broken while in beast form your transformation ends and any excess damage becomes Madness.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Beast Shape": {
                        "name": "Beast Shape",
                        "description": "You assume the form of a beast that you are familiar with of one-half your level or less.",
                        "effects": [
                            {
                                "name": "Beast Shape"
                            }
                        ]
                    },
                    "Revert Shape": {
                        "name": "Revert Shape",
                        "description": "You end your bestial transformation, returning to your normal form."
                    }
                }
            }
        },
        "Shield Bash": {
            "name": "Shield Bash",
            "description": "<p>You are practiced at fighting with shield, using it to slam into and imbalance your foes.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Shield Bash": {
                        "name": "Shield Bash",
                        "description": "<p>Following a basic Strike with your mainhand weapon, you <strong>Strike</strong> with your shield, causing the @Condition[staggered] condition for one Round.</p>",
                        "effects": [
                            {
                                "name": "Shield Bash"
                            }
                        ]
                    }
                }
            }
        },
        "Shield Charge": {
            "name": "Shield Charge",
            "description": "<p>A defensive technique in which you drive forward, slamming and pushing foes out of your path. You charge up to 20 feet in a straight line and perform an offhand shield <strong>Strike</strong> against each successive foe along your path.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Shield Charge": {
                        "name": "Shield Charge",
                        "description": "<p>You charge forward in a straight line, passing through the space of any creatures you encounter and making a <strong>Strike </strong>against each successive foe. Any creature <strong>Critically Hit</strong> by the attack may be pushed into an adjacent space of your choosing. You may not end your charge in the same space as another creature.</p>"
                    }
                }
            }
        },
        "Shield Combat Proficiency": {
            "name": "Shield Combat Proficiency",
            "description": "<p>You have a fluent education in the use of shields in combat. You gain the <strong>Journeyman</strong> training rank and a <strong>+1 Skill Bonus</strong> with weapons in the <strong>Shield </strong>category.</p>"
        },
        "Shield Combat Training": {
            "name": "Shield Combat Training",
            "description": "<p>You have a basic education in the usage of shields in combat. You are no longer treated as <strong>Untrained</strong> with weapons in the <strong>Shield </strong>category.</p>"
        },
        "Shield Ward": {
            "name": "Shield Ward",
            "description": "<p>You have mastered a specialized technique to incorporate a physical shield into the <strong>Ward</strong> gesture. You may ignore the free-hand requirement for spells using the Ward gesture while you have a <strong>Shield</strong> equipped.</p>"
        },
        "Skirmisher": {
            "name": "Skirmisher",
            "description": "<p>You are adept at entering and exiting the fray. When moving out of the <strong>Engagement</strong> radius of an enemy, that enemy has 2 Banes to any <strong>Disengagement Strike</strong> against you."
        },
        "Smithing Journeyman": {
            "name": "Smithing Journeyman"
        },
        "Smithing Novice": {
            "name": "Smithing Novice"
        },
        "Snakeblood": {
            "name": "Snakeblood",
            "description": "Your supernatural toughness makes you resistant to venoms and toxins. You gain +5 Resistance to Poison damage."
        },
        "Society Adept": {
            "name": "Society Adept",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You gain the <strong>Adept </strong>rank in the <strong>Society </strong>skill, providing a <strong>+2 Skill Bonus</strong>.</span></p>"
        },
        "Society Journeyman": {
            "name": "Society Journeyman",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You gain the <strong>Journeyman </strong>rank in the <strong>Society </strong>skill, providing a <strong>+1 Skill Bonus</strong>.</span></p>"
        },
        "Society Master": {
            "name": "Society Master",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You gain the <strong>Master </strong>rank in the <strong>Society </strong>skill, providing a <strong>+3 Skill Bonus</strong>.</span></p>"
        },
        "Society Novice": {
            "name": "Society Novice",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You have learned the fundamental building blocks of Society, the mores, beliefs, history and politics which directly inform the growth of culture. You gain the <strong>Novice</strong> rank in the <strong>Society </strong>skill and are no longer considered <strong>Untrained</strong> in that skill.</span></p><p><span style=\"font-family:Vollkorn, serif\">You understand that history and politics contribute prominently to the way decisions are made at the highest and lowest levels of society, and how tradition frequently informs subgroups of society to place them in opposition to one another.</span></p>"
        },
        "Soothe": {
            "name": "Soothe",
            "description": "You administer a soothing Performance which rallies your allies, restoring Morale.",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Soothe": {
                        "name": "Soothe",
                        "description": "<p>You perform a calming verse, benefiting all allies who can perceive you within 12 feet. Make a <strong>Performance Check</strong> against the Madness threshold of each ally. On success, each ally's Morale is restored.</p>"
                    }
                }
            }
        },
        "Spellblade": {
            "name": "Spellblade",
            "description": "<p>You are an arcane warrior who can weave together Strike and Spell relying on both martial and arcane techniques in battle. The physical strikes of your weaponry partially substitute for the somatic gestures of traditional spellcraft.</p><p>While wielding a <strong>Melee</strong> weapon as your mainhand weapon, spells you cast using <strong>Gesture: Strike</strong> benefit from your weapon's damage bonus.</p><p>Immediately after performing a <strong>Strike</strong> with a melee weapon, you may cast a spell with its <strong>Action</strong> cost reduced by 1.</p>"
        },
        "Spellmute": {
            "name": "Spellmute",
            "description": "<p>Currents of magic flow strangely around you, as if unaware of your presence.</p><p>You cannot perform any action with the <strong>Spell</strong> tag. Spells which target you suffer +2 <strong>Banes</strong> regardless of whether they impose harmful or beneficial effects.</p>"
        },
        "Steadfast": {
            "name": "Steadfast",
            "description": "Your patient resolve allows you to endure psychologically grueling ordeals with steadfast determination.",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Steadfast Resolve": {
                        "name": "Steadfast Resolve",
                        "description": "<p>You harden yourself against demoralization. Your Morale is increased by your Wisdom score and you temporarily gain the Resolute condition.</p>",
                        "effects": [
                            {
                                "name": "Steadfast Resolve"
                            }
                        ]
                    }
                }
            }
        },
        "Stealth Adept": {
            "name": "Stealth Adept",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You gain the <strong>Adept </strong>rank in the <strong>Stealth </strong>skill, providing a <strong>+2 Skill Bonus</strong>.</span></p>"
        },
        "Stealth Journeyman": {
            "name": "Stealth Journeyman",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You gain the <strong>Journeyman </strong>rank in the <strong>Stealth </strong>skill, providing a <strong>+1 Skill Bonus</strong>.</span></p>"
        },
        "Stealth Master": {
            "name": "Stealth Master",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You gain the <strong>Master </strong>rank in the <strong>Stealth </strong>skill, providing a <strong>+3 Skill Bonus</strong>.</span></p>"
        },
        "Stealth Novice": {
            "name": "Stealth Novice",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You have received training in the basics of stealth, infiltration, and subterfuge. You gain the <strong>Novice</strong> rank in the <strong>Stealth </strong>skill and are no longer considered <strong>Untrained</strong> in that skill.</span></p><p><span style=\"font-family:Vollkorn, serif\">You know how to use light and shadow to mask your presence, to distribute your weight when walking in order to move more quietly, and you have learned a few tricks of disguise in order to blend into a crowd. You can appear unsuspicious when surrounded by others, hide in a darkened room, and can move silently enough to avoid detection by the average person.</span></p>"
        },
        "Still Lake": {
            "name": "Still Lake",
            "description": "<p>Your life experiences provide serenity that allows you to resist the attempted manipulation of others.</p><p><strong>Skill Attacks</strong> against you from any of the <strong>Social</strong> skills are made with <strong>2 Banes</strong>.</p>"
        },
        "Strategic Repositioning": {
            "name": "Strategic Repositioning",
            "description": "<p>You are always thinking ahead about where to position yourself should danger loom. Before <strong>Turn 1</strong> of a Combat encounter, provided that you are not Unaware, you may immediately move 4 feet in any permitted direction.</p><p>If multiple combatants have this feature, repositioning occurs in reverse order of Initiative.</p>"
        },
        "Strike First": {
            "name": "Strike First",
            "description": "Shoot first, ask questions later. You gain <strong>+1 Boon</strong> on any Strike or Spell attack against an enemy whose initiative score is lower than your own."
        },
        "Strong Grip": {
            "name": "Strong Grip",
            "description": "Your grasp of your weaponry is firm and unyielding. You can perform Actions which require a free hand while wielding a two-handed weapon. Attempts to Disarm you are made with +2 Banes."
        },
        "Stunning Strike": {
            "name": "Stunning Strike",
            "description": "An challenging unarmed technique which targets vital pressure points on the bodies of your adversaries. You unleash a debilitating strike which, if successful, leaves your enemy Stunned.",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Stunning Strike": {
                        "name": "Stunning Strike",
                        "description": "<p>You <strong>Strike</strong> a vital pressure point, inflicting <strong>Stun</strong> on your enemy for 1 Round if successful.</p>",
                        "effects": [
                            {
                                "name": "Stunning Strike"
                            }
                        ]
                    }
                }
            }
        },
        "Subtle Extrication": {
            "name": "Subtle Extrication",
            "description": "<p>You understand how to move away from an opponent without exposing yourself to the worst attacks in return. Any <strong>Disengagement Attack</strong> against you is performed without the 2 Boons that would ordinarily apply to such an attack.</p>"
        },
        "Sundering Strike": {
            "name": "Sundering Strike",
            "description": "<p>You know a martial technique to exploit the weakest points of an enemy's defenses, exposing them to further harm.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Sundering Strike": {
                        "name": "Sundering Strike",
                        "description": "<p>You make a <strong>Strike</strong> with your mainhand weapon which, if successful, applies the <strong>Exposed </strong>condition to your target for 3 rounds. This attack is <strong>Difficult</strong> to perform and deals reduced damage.</p>",
                        "effects": [
                            {
                                "name": "Sundered Armor"
                            }
                        ]
                    }
                }
            }
        },
        "Surgeweaver": {
            "name": "Surgeweaver",
            "description": "<p>You are highly skilled in weaving the Rune of Lightning. Spells which use this Rune cause the Shocked condition on Critical Hits.</p><p>The Shocked effect lasts for 1 Round, deals half your Intellect score as Lightning damage to Morale, and applies the Staggered condition.</p>"
        },
        "Swashbuckler": {
            "name": "Swashbuckler",
            "description": "<p>Your bravado inspires your allies and cowes your enemies. When you Dodge or Parry a Strike, the attacker loses Morale equal to your Presence attribute. When you achieve a Critical Hit, all nearby allies who can see you gain Morale equal to your Presence attribute.</p>"
        },
        "Swipe": {
            "name": "Swipe",
            "description": "You perform a broad swipe with your weapon, hitting two adjacent targets within your weapon range.",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Swipe": {
                        "name": "Swipe",
                        "description": "<p>You perform a <strong>Strike</strong> against two adjacent enemies, attacking both of them using a single swing of your great weapon.</p>"
                    }
                }
            }
        },
        "Tactician": {
            "name": "Tactician",
            "description": "<p>You are a cunning battlefield tactician, able to organize and direct your allies to act with increased effectiveness.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Tactical Plan": {
                        "name": "Tactical Plan",
                        "description": "Using 10 words or fewer, describe a course of action to an ally who acts after you in Initiative order. If that ally carries out your described plan later in the same Round, they gain +2 Boons on any dice rolls associated with that plan. The Gamemaster may arbitrate whether or not the plan was followed."
                    }
                }
            }
        },
        "Tailoring Journeyman": {
            "name": "Tailoring Journeyman"
        },
        "Tailoring Novice": {
            "name": "Tailoring Novice"
        },
        "Talisman Weapon Proficiency": {
            "name": "Talisman Weapon Proficiency",
            "description": "<p>You have a fluent education in the use of talismans, orbs, foci, or other similar weapons. You gain the <strong>Journeyman</strong> training rank and a <strong>+1 Skill Bonus</strong> with weapons in the <strong>Talisman </strong>category.</p>"
        },
        "Talisman Weapon Training": {
            "name": "Talisman Weapon Training",
            "description": "<p>You have a basic education in the use of talismans, orbs, foci, or other similar weapons. You are no longer treated as <strong>Untrained</strong> with weapons in the <strong>Talisman</strong> categories.</p>"
        },
        "Testudo": {
            "name": "Testudo",
            "description": "You are highly skilled in using shields to adopt a defensive posture. You gain double the benefit of the <strong>Guarded</strong> condition against <strong>Weapon Attacks</strong> while wielding a shield."
        },
        "Thick Skin": {
            "name": "Thick Skin",
            "description": "Your physical toughness makes you more resistant to harm. You gain +2 Resistance to Bludgeoning, Slashing, and Piercing damage."
        },
        "Thread the Needle": {
            "name": "Thread the Needle",
            "description": "You concentrate to fire a shot into the swirl of melee. This attack benefits from <strong>Flanking</strong> as if it were a melee attack.",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Thread the Needle": {
                        "name": "Thread the Needle",
                        "description": "<p>You fire a precise shot into melee combat, targeting an enemy which is engaged by one of your allies.</p>"
                    }
                }
            }
        },
        "True Grit": {
            "name": "True Grit",
            "description": "<p>Your physical tenacity allows you to remain composed while surrounded by foes. Your <strong>Engagement</strong> increases by +1, allowing you to simultaneously engage more adjacent foes.</p>"
        },
        "Tumble Through": {
            "name": "Tumble Through",
            "description": "<p>You can use your athleticism in dangerous situations to escape harm or bypass enemy combatants.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Tumble": {
                        "name": "Tumble",
                        "description": "<p>Make a <strong>Athletics </strong>skill Attack against an adjacent enemy contested by your target's <strong>Reflex</strong> defense.</p><p>On a success you may move up to twice your <strong>Stride</strong>, including the ability to pass through your target enemy's space, without provoking any <strong>Disengagement</strong> reactions.</p><p>On a failure your movement is blocked and your remain in your current position.</p>"
                    }
                }
            }
        },
        "Twinned Shot": {
            "name": "Twinned Shot",
            "description": "<p>You prepare two shots to fire simultaneously at a single target.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Twinned Shot": {
                        "name": "Twinned Shot",
                        "description": "<p>Using this <strong>Difficult</strong> technique, you fire two projectiles at once making two <strong>Strike</strong> attacks against the same target.</p>"
                    }
                }
            }
        },
        "Unarmed Blocking": {
            "name": "Unarmed Blocking",
            "description": "Your honed reflexes and physical toughness allow you to block enemy blows using your bare arms. While <strong>Unarmed</strong>, half your Toughness score contributes to your <strong>Block</strong> defense."
        },
        "Unarmed Combat Proficiency": {
            "name": "Unarmed Combat Proficiency",
            "description": "<p>You have a fluent education  in hand-to-hand combat and other martial arts.  You gain the <strong>Journeyman</strong> training rank and a <strong>+1 Skill Bonus</strong> with weapons in the <strong>Unarmed </strong>category.</p>"
        },
        "Unarmed Combat Training": {
            "name": "Unarmed Combat Training",
            "description": "<p>You have a basic education in hand-to-hand combat and other martial arts. You are no longer treated as <strong>Untrained</strong> with weapons in the <strong>Unarmed </strong>category.</p>"
        },
        "Unshakeable Stance": {
            "name": "Unshakeable Stance",
            "description": "You cannot be unvoluntarily Moved or knocked Prone by any action that is not a Critical Success rolled by an enemy or a Critical Failure rolled by yourself."
        },
        "Uppercut": {
            "name": "Uppercut",
            "description": "A two-handed weapon technique where you swing your weapon upwards, making a second Strike with the backswing of your weapon.",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Uppercut": {
                        "name": "Uppercut",
                        "description": "<p>Following a basic Strike attack which did not critically miss, you <strong>Strike</strong> the same target again with the backswing of your weapon at reduced <strong>Action</strong> cost.</p>"
                    }
                }
            }
        },
        "Versatile Translator": {
            "name": "Versatile Translator",
            "description": "<p>You have a scholarly background in linguistics or an intuitive knack for languages. Your capabilities enable you to decipher the basic meaning of text written in a variety of languages.</p><p>You can translate text of a language you do not know that is written using a common set of glyphs or characters to a language that you do know. Creating such a translation requires spending one minute per word to transcribe the text into a language which you understand.</p><p>Your translations are rudimentary and often lack nuance, but they do contain all essential points of the text.</p>"
        },
        "Voidcaller": {
            "name": "Voidcaller",
            "description": "<p>You are highly skilled in weaving the Rune of Shadow. Spells which use this Rune cause the Entropy condition on Critical Hits.</p><p>The Entropy effect lasts for 1 Round, deals half your Presence score as Void damage to Morale, and applies the Frightened condition.</p>"
        },
        "Vow of Animus": {
            "name": "Vow of Animus",
            "description": "You swear a vow to destroy a specific character or creature. You gain +2 Boons to Strike or Spell attacks against to subject of your vow. You may only swear such a vow against one enemy at a time. Swearing a new vow relinquishes your prior vow.",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Vow of Animus": {
                        "name": "Vow of Animus",
                        "description": "<p>You vow to vanquish a specific foe who becomes the subject of your animus.</p>",
                        "effects": [
                            {
                                "name": "Vow of Animus"
                            }
                        ]
                    }
                }
            }
        },
        "War Mage": {
            "name": "War Mage",
            "description": "<p>Your spellcraft is honed as a weapon of war to thwart the incantations of other magi. You may ask the Gamemaster if you know a Rune capable of countering an enemy spell, even if you do not recognize the spell being cast. You gain +2 Boons to any Counterspell attempt.</p>"
        },
        "Weak Points": {
            "name": "Weak Points",
            "description": "You identify moments of opportunity to strike at an enemy's weak points. When attacking a target that is <strong>Unaware</strong>, <strong>Flanked</strong>, or <strong>Exposed</strong> using Finesse weaponry, you gain +2 damage to any Strike."
        },
        "Wilderness Adept": {
            "name": "Wilderness Adept",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You gain the <strong>Adept </strong>rank in the <strong>Wilderness </strong>skill, providing a <strong>+2 Skill Bonus</strong>.</span></p>"
        },
        "Wilderness Journeyman": {
            "name": "Wilderness Journeyman",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You gain the <strong>Journeyman </strong>rank in the <strong>Wilderness </strong>skill, providing a <strong>+1 Skill Bonus</strong>.</span></p>"
        },
        "Wilderness Master": {
            "name": "Wilderness Master",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You gain the <strong>Master </strong>rank in the <strong>Wilderness </strong>skill, providing a <strong>+3 Skill Bonus</strong>.</span></p>"
        },
        "Wilderness Novice": {
            "name": "Wilderness Novice",
            "description": "<p><span style=\"font-family:Vollkorn, serif\">You have received training in the basics of wilderness survival and traversal. You gain the <strong>Novice</strong> rank in the <strong>Wilderness </strong>skill and are no longer considered <strong>Untrained</strong> in that skill.</span></p><p><span style=\"font-family:Vollkorn, serif\">You know how to find and construct safe shelter from the elements, to start a fire for warmth, to keep cool in hot environments. You can find safe, drinkable water in most places, and how to identify which plants and animals can serve as safe food sources.</span></p>"
        },
        "Wildspeaker": {
            "name": "Wildspeaker",
            "description": "<p>You have a preternatural knack for communicating with animals. Through body language and sounds, you are capable of interpreting and communicating in the language of the wilderness.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Wildspeak": {
                        "name": "Wildspeak",
                        "description": "<p>If you succeed on a [[/skillCheck wilderness 14]] check, you may pose simple questions to a <strong>Beast</strong> which can perceive you. As long as the creature is not hostile it will respond accurately within the limits of its own knowledge.</p><ul><li><p>Beasts with an <strong>Intellect</strong> score of zero are incapable of understanding you.</p></li><li><p>Beasts with an <strong>Intellect</strong> score of 1 can only respond with \"yes\" or \"no\" responses.</p></li><li><p>Beasts with an <strong>Intellect</strong> score greater than 1 can provide simple multi-word responses.</p></li></ul>"
                    }
                }
            }
        },
        "Wrestler": {
            "name": "Wrestler",
            "description": "You are able to subdue opponents using your physical Strength.",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Grapple": {
                        "name": "Grapple",
                        "description": "<p>Perform a <strong>Athletics</strong> skill attack against an adjacent target. If successful, both you and your target are Restrained for 1 Round.</p>",
                        "effects": [
                            {
                                "name": "Grapple"
                            }
                        ]
                    }
                }
            }
        },
        "Zealous Smite": {
            "name": "Zealous Smite",
            "description": "<p>You can imbue righteous power into your blow with a heavy weapon.</p>",
            "actions": {
                "converter": "translateActionsMap",
                "entries": {
                    "Zealous Smite": {
                        "name": "Zealous Smite",
                        "condition": "You are attacking an Exposed enemy with a Heavy weapon.",
                        "description": "<p>You <strong>Strike</strong> using a Strength-based weapon. The attack becomes <strong>Deadly</strong> and any damage dealt is <strong>Radiant</strong>.</p>"
                    }
                }
            }
        }
    },
    "mapping": {
        "description": "system.description",
        "actions": "system.actions",
        "effects": "system.actions.*.effects"
    }
}